/********************************************************************************************************
* 版    权: Copyright (c) 2020, VOS Open source. All rights reserved.
* 文    件: vatomic.c
* 作    者: 156439848@qq.com; vincent_cws2008@gmail.com
* 版    本: VOS V1.0
* 历    史：
* --20200912：创建文件
*********************************************************************************************************/
#include "vatomic.h"

/********************************************************************************************************
* 函数：void VAtomicLockInit(StAtomicLock *pAtom);
* 描述:  初始化原子操作
* 参数:
* [1] pAtom: 原子操作控制量
* 返回：无
* 注意：无
*********************************************************************************************************/
void VAtomicLockInit(StAtomicLock *pAtom)
{
	pAtom->lock = 0;
}

/********************************************************************************************************
* 函数：s32 VAtomicLockTry(StAtomicLock *pAtom);
* 描述:  原子操作试锁
* 参数:
* [1] pAtom: 原子操作控制量
* 返回：无
* 注意：无
*********************************************************************************************************/
s32 VAtomicLockTry(StAtomicLock *pAtom)
{
	s32 ret;
	__asm__ __volatile__(
	"	ldrex 	%0, [%1]\n"
	"	cmp 	%0, #0\n"
	"	strexeq %0, %2, [%1]"
	: "=&r" (ret)
	: "r" (&pAtom->lock), "r" (1)
	:"cc");
	return !ret;
}

/********************************************************************************************************
* 函数：void VAtomicLock(StAtomicLock *pAtom);
* 描述:  原子操作锁，如果被占用，一直循环，使用在多核情况下
* 参数:
* [1] pAtom: 原子操作控制量
* 返回：无
* 注意：无
*********************************************************************************************************/
void VAtomicLock(StAtomicLock *pAtom)
{
	s32 temp;

	__asm__ __volatile__(
	"1:	ldrex 	%0, [%1]\n"
	"	cmp 	%0, #0\n"
	"	strexeq %0, %2, [%1]\n"
	"	cmpeq 	%0, #0\n"
	"	bne 	1b"
	: "=&r" (temp)
	: "r" (&pAtom->lock), "r" (1)
	: "cc");

}


/********************************************************************************************************
* 函数：void VAtomicUnlock(StAtomicLock *pAtom);
* 描述:  原子操作解锁，使用在多核情况下
* 参数:
* [1] pAtom: 原子操作控制量
* 返回：无
* 注意：无
*********************************************************************************************************/
void VAtomicUnlock(StAtomicLock *pAtom)
{
	s32 temp;
	__asm__ __volatile__(
	"  str 	%0, [%1]\n"
	:
	: "r" (0), "r" (&pAtom->lock)
	: "cc");
}

u32 __vos_irq_save();
void __vos_irq_restore(u32 save);

/********************************************************************************************************
* 函数：u32 VAtomicLockIrqSave(StAtomicLock *pAtom);
* 描述:  禁止本核中断和原子锁操作，使用在多核情况下
* 参数:
* [1] pAtom: 原子操作控制量
* 返回：无
* 注意：无
*********************************************************************************************************/
u32 VAtomicLockIrqSave(StAtomicLock *pAtom)
{
	u32 save = __vos_irq_save();
	VAtomicLock(pAtom);
	return save;
}

/********************************************************************************************************
* 函数：void VAtomicLockIrqRestore(StAtomicLock *pAtom, u32 irq_save);
* 描述:  原子解锁操作和打开本核中断，使用在多核情况下
* 参数:
* [1] pAtom: 原子操作控制量
* 返回：无
* 注意：无
*********************************************************************************************************/
void VAtomicLockIrqRestore(StAtomicLock *pAtom, u32 irq_save)
{
	VAtomicUnlock(pAtom);
	__vos_irq_restore(irq_save);
}



